emacs/config.org
#+TITLE: wingej0's Emacs Config
#+AUTHOR: Jeff Winget (wingej0)
#+DESCRIPTION: My personal Emacs config
#+STARTUP: showeverything
#+OPTIONS: toc:2

* Programs to Load

** Load Package Manager

#+begin_src emacs-lisp
  ; Initialize package sources
  (require 'package)

  (setq package-archives '(("melpa" . "https://melpa.org/packages/")
			   ("org" . "https://orgmode.org/elpa/")
			   ("elpa" . "https://elpa.gnu.org/packages/")))

  (package-initialize)
  (unless package-archive-contents
   (package-refresh-contents))

  ;; Initialize use-package on non-Linux platforms
  (unless (package-installed-p 'use-package)
     (package-install 'use-package))

  (require 'use-package)
  (setq use-package-always-ensure t)
#+end_src

** Install and Configure Ivy for Autocompletion

#+begin_src emacs-lisp
  (use-package ivy
    :diminish
    :bind (("C-s" . swiper)
	   :map ivy-minibuffer-map
	   ("TAB" . ivy-alt-done)	
	   ("C-l" . ivy-alt-done)
	   ("C-j" . ivy-next-line)
	   ("C-k" . ivy-previous-line)
	   :map ivy-switch-buffer-map
	   ("C-k" . ivy-previous-line)
	   ("C-l" . ivy-done)
	   ("C-d" . ivy-switch-buffer-kill)
	   :map ivy-reverse-i-search-map
	   ("C-k" . ivy-previous-line)
	   ("C-d" . ivy-reverse-i-search-kill))
    :config
    (ivy-mode 1))

  (use-package counsel
    :bind (("M-x" . counsel-M-x)
	   ("C-x b" . counsel-ibuffer)
	   ("C-x C-f" . counsel-find-file)
	   :map minibuffer-local-map
	   ("C-r" . 'counsel-minibuffer-history))
    :config
    (setq ivy-initial-inputs-alist nil)) ;; Don't start searches with ^
#+end_src

* General Configuration

** Functionality

#+begin_src emacs-lisp
  ;; Make ESC quit prompts
  (global-set-key (kbd "<escape>") 'keyboard-escape-quit)
#+end_src

** User Interface

Here are some basic UI settings to make the editor look more minimal.

#+begin_src emacs-lisp
  (setq inhibit-startup-message t)

  (scroll-bar-mode -1)        ; Disable visible scrollbar
  (tool-bar-mode -1)          ; Disable the toolbar
  (tooltip-mode -1)           ; Disable tooltips
  (set-fringe-mode 20)        ; Give some breathing room

  (menu-bar-mode -1)          ; Disable the menu bar

  ;; Disable title bar in Gnome
  (setq default-frame-alist '((undecorated . t)))

  ;; Set up the visible bell
  (setq visible-bell t)
#+end_src

** Font and theme (this will be changed as I go, I'm sure)

#+begin_src emacs-lisp
  (set-face-attribute 'default nil :font "Fira Code Nerd Font" :height 120)

  ;; Set color theme
  (load-theme 'wombat)

  ;; Transparency
  (set-frame-parameter nil 'alpha-background 80) ; For current frame
  (add-to-list 'default-frame-alist '(alpha-background . 80)) ; For all new frames henceforth
#+end_src

** Doom Modeline

#+begin_src emacs-lisp
  ;; NOTE: The first time you load your configuration on a new machine, you'll
  ;; need to run the following command interactively so that mode line icons
  ;; display correctly:
  ;;
  ;; M-x all-the-icons-install-fonts

  (use-package all-the-icons)

  (use-package doom-modeline
    :init (doom-modeline-mode 1))
#+end_src
